avr-rust/avrd/packs/xmegad/ATxmega64D3.atdf
        <register caption="Control register C" name="CTRLC" offset="0x02" size="1">
          <bitfield caption="Compare D Output Value" mask="0x08" name="CMPD"/>
          <bitfield caption="Compare C Output Value" mask="0x04" name="CMPC"/>
          <bitfield caption="Compare B Output Value" mask="0x02" name="CMPB"/>
          <bitfield caption="Compare A Output Value" mask="0x01" name="CMPA"/>
        </register>
        <register caption="Control Register D" name="CTRLD" offset="0x03" size="1">
          <bitfield caption="Event Action" mask="0xE0" name="EVACT" values="TC_EVACT"/>
          <bitfield caption="Event Delay" mask="0x10" name="EVDLY"/>
          <bitfield caption="Event Source Select" mask="0x0F" name="EVSEL" values="TC_EVSEL"/>
        </register>
        <register caption="Control Register E" name="CTRLE" offset="0x04" size="1">
          <bitfield caption="Byte Mode" mask="0x01" name="BYTEM"/>
        </register>
        <register caption="Interrupt Control Register A" name="INTCTRLA" offset="0x06" size="1">
          <bitfield caption="Error Interrupt Level" mask="0x0C" name="ERRINTLVL" values="TC_ERRINTLVL"/>
          <bitfield caption="Overflow interrupt level" mask="0x03" name="OVFINTLVL" values="TC_OVFINTLVL"/>
        </register>
        <register caption="Interrupt Control Register B" name="INTCTRLB" offset="0x07" size="1">
          <bitfield caption="Compare or Capture D Interrupt Level" mask="0xC0" name="CCDINTLVL" values="TC_CCDINTLVL"/>
          <bitfield caption="Compare or Capture C Interrupt Level" mask="0x30" name="CCCINTLVL" values="TC_CCCINTLVL"/>
          <bitfield caption="Compare or Capture B Interrupt Level" mask="0x0C" name="CCBINTLVL" values="TC_CCBINTLVL"/>
          <bitfield caption="Compare or Capture A Interrupt Level" mask="0x03" name="CCAINTLVL" values="TC_CCAINTLVL"/>
        </register>
        <register caption="Control Register F Clear" name="CTRLFCLR" offset="0x08" size="1">
          <bitfield caption="Command" mask="0x0C" name="CMD"/>
          <bitfield caption="Lock Update" mask="0x02" name="LUPD"/>
          <bitfield caption="Direction" mask="0x01" name="DIR"/>
        </register>
        <register caption="Control Register F Set" name="CTRLFSET" offset="0x09" size="1">
          <bitfield caption="Command" mask="0x0C" name="CMD" values="TC_CMD"/>
          <bitfield caption="Lock Update" mask="0x02" name="LUPD"/>
          <bitfield caption="Direction" mask="0x01" name="DIR"/>
        </register>
        <register caption="Control Register G Clear" name="CTRLGCLR" offset="0x0A" size="1">
          <bitfield caption="Compare or Capture D Buffer Valid" mask="0x10" name="CCDBV"/>
          <bitfield caption="Compare or Capture C Buffer Valid" mask="0x08" name="CCCBV"/>
          <bitfield caption="Compare or Capture B Buffer Valid" mask="0x04" name="CCBBV"/>
          <bitfield caption="Compare or Capture A Buffer Valid" mask="0x02" name="CCABV"/>
          <bitfield caption="Period Buffer Valid" mask="0x01" name="PERBV"/>
        </register>
        <register caption="Control Register G Set" name="CTRLGSET" offset="0x0B" size="1">
          <bitfield caption="Compare or Capture D Buffer Valid" mask="0x10" name="CCDBV"/>
          <bitfield caption="Compare or Capture C Buffer Valid" mask="0x08" name="CCCBV"/>
          <bitfield caption="Compare or Capture B Buffer Valid" mask="0x04" name="CCBBV"/>
          <bitfield caption="Compare or Capture A Buffer Valid" mask="0x02" name="CCABV"/>
          <bitfield caption="Period Buffer Valid" mask="0x01" name="PERBV"/>
        </register>
        <register caption="Interrupt Flag Register" name="INTFLAGS" offset="0x0C" size="1">
          <bitfield caption="Compare or Capture D Interrupt Flag" mask="0x80" name="CCDIF"/>
          <bitfield caption="Compare or Capture C Interrupt Flag" mask="0x40" name="CCCIF"/>
          <bitfield caption="Compare or Capture B Interrupt Flag" mask="0x20" name="CCBIF"/>
          <bitfield caption="Compare or Capture A Interrupt Flag" mask="0x10" name="CCAIF"/>
          <bitfield caption="Error Interrupt Flag" mask="0x02" name="ERRIF"/>
          <bitfield caption="Overflow Interrupt Flag" mask="0x01" name="OVFIF"/>
        </register>
        <register caption="Temporary Register For 16-bit Access" name="TEMP" offset="0x0F" size="1"/>
        <register caption="Count" name="CNT" offset="0x20" size="2"/>
        <register caption="Period" name="PER" offset="0x26" size="2"/>
        <register caption="Compare or Capture A" name="CCA" offset="0x28" size="2"/>
        <register caption="Compare or Capture B" name="CCB" offset="0x2A" size="2"/>
        <register caption="Compare or Capture C" name="CCC" offset="0x2C" size="2"/>
        <register caption="Compare or Capture D" name="CCD" offset="0x2E" size="2"/>
        <register caption="Period Buffer" name="PERBUF" offset="0x36" size="2"/>
        <register caption="Compare Or Capture A Buffer" name="CCABUF" offset="0x38" size="2"/>
        <register caption="Compare Or Capture B Buffer" name="CCBBUF" offset="0x3A" size="2"/>
        <register caption="Compare Or Capture C Buffer" name="CCCBUF" offset="0x3C" size="2"/>
        <register caption="Compare Or Capture D Buffer" name="CCDBUF" offset="0x3E" size="2"/>
      </register-group>
      <register-group caption="16-bit Timer/Counter 1" name="TC1" size="60">
        <register caption="Control  Register A" name="CTRLA" offset="0x00" size="1">
          <bitfield caption="Clock Selection" mask="0x0F" name="CLKSEL" values="TC_CLKSEL"/>
        </register>
        <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
          <bitfield caption="Compare or Capture B Enable" mask="0x20" name="CCBEN"/>
          <bitfield caption="Compare or Capture A Enable" mask="0x10" name="CCAEN"/>
          <bitfield caption="Waveform generation mode" mask="0x07" name="WGMODE" values="TC_WGMODE"/>
        </register>
        <register caption="Control register C" name="CTRLC" offset="0x02" size="1">
          <bitfield caption="Compare B Output Value" mask="0x02" name="CMPB"/>
          <bitfield caption="Compare A Output Value" mask="0x01" name="CMPA"/>
        </register>
        <register caption="Control Register D" name="CTRLD" offset="0x03" size="1">
          <bitfield caption="Event Action" mask="0xE0" name="EVACT" values="TC_EVACT"/>
          <bitfield caption="Event Delay" mask="0x10" name="EVDLY"/>
          <bitfield caption="Event Source Select" mask="0x0F" name="EVSEL" values="TC_EVSEL"/>
        </register>
        <register caption="Control Register E" name="CTRLE" offset="0x04" size="1">
          <bitfield caption="Byte Mode" mask="0x01" name="BYTEM"/>
        </register>
